MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_usb_drd_core.h
void USB_DRD_SET_CHEP_DBUF_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num,
                               usb_core_ep_direction_t direction, uint32_t count);

uint16_t USB_DRD_GET_CHEP_TX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num);
uint16_t USB_DRD_GET_CHEP_RX_STATUS(uint32_t instance, usb_core_phy_chep_t ch_ep_num);
uint16_t USB_DRD_GET_CHEP_TX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num);
uint16_t USB_DRD_GET_CHEP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ch_ep_num);
/**
  * @}
  */

/** @defgroup USB_DRD_CORE_Device_Exported_Functions Exported Device Functions
  * @{
  */
usb_core_status_t USB_DRD_PCD_InitDriver(usb_core_pcd_driver_t *p_driver);
usb_core_status_t USB_DRD_InitDevice(uint32_t instance, const usb_core_config_params_t *p_core_config);
usb_core_status_t USB_DRD_StartDevice(uint32_t instance);
usb_core_status_t USB_DRD_StopDevice(uint32_t instance);
usb_core_status_t USB_DRD_ActivateEndpoint(uint32_t instance, usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_DeactivateEndpoint(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_StartEndpointXfer(uint32_t instance, usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_StopEndpointXfer(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_SetEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_ClearEndpointStall(uint32_t instance, const usb_core_ep_t *p_ep);
usb_core_status_t USB_DRD_SetDeviceAddress(uint32_t instance, uint8_t address);
usb_core_status_t USB_DRD_ConnectDevice(uint32_t instance);
usb_core_status_t USB_DRD_DisconnectDevice(uint32_t instance);
usb_core_device_speed_t USB_DRD_GetDeviceSpeed(uint32_t instance);

usb_core_status_t  USB_DRD_BCD_SetMode(uint32_t instance,
                                       usb_core_bcd_config_t bcd_config, usb_core_bcd_config_sts_t bcd_sts);
usb_core_bcd_port_status_t USB_DRD_BCD_SetPortDetection(uint32_t instance, usb_core_bcd_detection_t detection);
usb_core_status_t USB_DRD_BCD_Activate(uint32_t instance);
usb_core_status_t USB_DRD_BCD_DeActivate(uint32_t instance);

usb_core_status_t USB_DRD_LPM_Activate(uint32_t instance);
usb_core_status_t USB_DRD_LPM_DeActivate(uint32_t instance);

usb_core_status_t USB_DRD_ActivateRemoteWakeup(uint32_t instance);
usb_core_status_t USB_DRD_DeActivateRemoteWakeup(uint32_t instance);

uint16_t USB_DRD_GET_EP_RX_CNT(uint32_t instance, usb_core_phy_chep_t ep_num);
uint16_t USB_DRD_GET_EP_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t ep_num);
uint16_t USB_DRD_GET_EP_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t ep_num);
/**
  * @}
  */

/** @defgroup USB_DRD_CORE_Host_Exported_Functions Exported Host Functions
  * @{
  */
usb_core_status_t USB_DRD_HCD_InitDriver(usb_core_hcd_driver_t *p_driver);
usb_core_status_t USB_DRD_PortReset(uint32_t instance, usb_core_port_reset_sts_t reset_status);
usb_core_status_t USB_DRD_PortSuspend(uint32_t instance);
usb_core_status_t USB_DRD_PortResume(uint32_t instance, usb_core_port_resume_sts_t resume_status);
usb_core_status_t USB_DRD_InitHost(uint32_t instance, const usb_core_config_params_t *p_core_config);
usb_core_status_t USB_DRD_StartHost(uint32_t instance);
usb_core_status_t USB_DRD_StopHost(uint32_t instance);
usb_core_port_speed_t USB_DRD_GetHostPortSpeed(uint32_t instance);
usb_core_status_t USB_DRD_PMAReset(void);
uint32_t USB_DRD_GetCurrentFrame(uint32_t instance);
uint32_t USB_DRD_GetDmaStatus(uint32_t instance);

usb_core_status_t USB_DRD_InitChannel(uint32_t instance, usb_core_ch_t *p_ch);
usb_core_status_t USB_DRD_CloseChannel(uint32_t instance, usb_core_ch_t *p_ch);
usb_core_status_t USB_DRD_HaltInChannel(uint32_t instance, usb_core_phy_chep_t phy_ch_num);
usb_core_status_t USB_DRD_HaltOutChannel(uint32_t instance, usb_core_phy_chep_t phy_ch_num);
usb_core_status_t USB_DRD_HaltChannel(uint32_t instance, const usb_core_ch_t *p_ch);
usb_core_status_t USB_DRD_StartChannelXfer(uint32_t instance, usb_core_ch_t *p_ch);
usb_core_channel_t USB_DRD_GetLogicalChannel(usb_core_phy_chep_t phy_ch_num, usb_core_ch_direction_t ch_dir);
void     USB_DRD_ClearPhysicalChannels(void);

uint16_t USB_DRD_GET_CH_RX_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num);
uint16_t USB_DRD_GET_CH_DBUF0_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num);
uint16_t USB_DRD_GET_CH_DBUF1_CNT(uint32_t instance, usb_core_phy_chep_t phy_ch_num);
/**
  * @}
  */
/**
  * @}
  */
#endif /* defined (USB_DRD_FS) */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_USB_DRD_CORE_H */
